Simulations Results/MeshConvergence02/mesh_50/Results/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
78269
(
(5.0205889 -0.038251047 -0.076520899)
(5.0347104 -0.016844418 -0.044742843)
(5.00526 -0.012184349 -0.0028493372)
(4.9928284 0.011645333 -0.0057192534)
(5.0042365 0.042793001 -0.023334619)
(5.0038073 0.090663243 -0.030875264)
(5.0212444 0.099252404 -0.0024141495)
(5.0164003 0.07659795 -0.013430777)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedNormalInletOutletVelocity;
        fixTangentialInflow yes;
        normalVelocity
        {
            type            fixedValue;
            value           uniform (5 0 0);
        }
        value           uniform (5 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
576
(
(4.9970578 0.051665855 0.037060238)
(5.0236743 0.051422371 0.058206111)
(5.0326072 0.023775454 0.0098205727)
(5.0404453 -0.005050941 0.023645969)
(5.0363392 -0.015868559 0.013658199)
(5.0315272 -0.014772934 0.02824172)
(5.0274249 -0.0054543054 0.029905271)
(5.0105548 0.099310169 0.021800688)
...
)
;
    }
    wall
    {
        type            slip;
    }
    constraint
    {
        type            symmetry;
    }
    defaultFaces
    {
        type            slip;
    }
}


// ************************************************************************* //
