Simulations Results/MeshConvergence02/mesh_50/Results/case/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type          forces;
    libs          (forces);

    writeControl  timeStep;
    timeInterval  1;

    log           yes;

    patches       (defaultFaces);
    rho           rhoInf;     // Indicates incompressible
    rhoInf        1;
    log           true;
    CofR          (0 0 0);    // Rotation around centre line of propeller
    writeFields     yes;


}


// ************************************************************************* //
